Show / Hide Table of Contents
Interface IBIMPluginFactory
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public interface IBIMPluginFactory
Properties
Improve this Doc   View Source
FeaAppName
Declaration
string FeaAppName { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
IdeaStaticaAppPath
Declaration
string IdeaStaticaAppPath { get; }
Property Value
 Type |  Description
 System.String
Methods
Improve this Doc   View Source
Create()
Declaration
IApplicationBIM Create()
Returns
 Type |  Description
 IApplicationBIM
 Improve this Doc
 View Source